In [1]:
# 행 삭제 0, 열 삭제 1
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
            '음악' : [85, 95, 100], '체육' : [100, 90, 90]}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(exam_data, index=['동덕', '여대', ' 문화'])

In [4]:
df

     수학  영어   음악   체육
동덕   90  98   85  100
여대   80  89   95   90
 문화  70  95  100   90

In [5]:
df2 = df[:]

In [6]:
df2

     수학  영어   음악   체육
동덕   90  98   85  100
여대   80  89   95   90
 문화  70  95  100   90

In [7]:
df2.drop('동덕', inplace=True)

/var/folders/78/c0mtglkd01qdvrc3g3x19nsc0000gn/T/ipykernel_1379/234443543.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('동덕', inplace=True)

In [8]:
df2

     수학  영어   음악  체육
여대   80  89   95  90
 문화  70  95  100  90

In [ ]:
df3